blog/app/views/comments/_comment.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1
---

<%= "No comments found" unless @article.comments.any?%>