blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = current_user

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`, `user_id`) VALUES ('test', 'testtttttttttttttt', '2021-07-16 11:22:57.566676', '2021-07-16 11:22:57.566676', 'public', 1)

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'First A', `articles`.`body` = 'This was first', `articles`.`updated_at` = '2021-07-14 12:02:02.284549' WHERE `articles`.`id` = 1