blog/app/controllers/comments_controller.rb

    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`, `status`) VALUES ('sjjabdkjas', 'sdjfakdjbjdfsbf\r\n', 3, '2021-07-16 11:37:38.682773', '2021-07-16 11:37:38.682773', 'public')

    def destroy
        print params
        @article = Article.find(params[:article_id])
        @comment = @article.comments.find(params[:id])
        @comment.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 3 AND `comments`.`id` = 4 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 4